//問題和警示
export const pauseStreetMessages = [
  {
    "message": "科學博物館重現了台灣第一部蒸汽火車「騰雲號」! 全球首座一比一真實尺寸模型，會願意來體驗嗎？🤔",
    "type": "question",
    "fakeAnswer": "除了騰雲號，科工館也時常舉辦各式各樣的展覽，歡迎來參觀。"
  },
  {
    "message": "請小心前方街道上的摩托車以及路邊的汽車⚠️",
    "type": "warning",
  },
  {
    "message": "你看，有一家「生存遊戲商店」，聽說最近非常流行，你有沒有需要購買一些裝備呢？🤨",
    "type": "question",
    "fakeAnswer": "那家店有初學者到高手的裝備，看你想挑什麼。逛逛也好啊。"
  },
  {
    "message": "左前方有一輛摩托車在雙黃線上，請注意⚠️",
    "type": "warning",
  },
  {
    "message": "右前方看到多輛腳踏車與多間旅店的組合! 你覺得這是策略還是巧合呢？🧐",
    "type": "question",
    "fakeAnswer": "近年來，共享單車的服務點數量不斷增加，使用方法也變得非常簡單。如果目的地不遠，不妨多使用共享單車，這不僅方便了出行，還有助於節能減碳。"
  },
  {
    "message": "高雄中學的建築特色典雅、優美，最早建築物名為紅樓，建於1921年。你是否還想要了解其他高雄中學的歷史呢？📞",
    "type": "question",
    "fakeAnswer": "高雄中學同時也是高雄學子的第一志願，如果想知道更多相關訊息可以至官方網站查看。"
  },
  {
    "message": "有一台汽車向右前方行駛，請注意⚠️",
    "type": "warning",
  },
  {
    "message": "我們前方有一家烤鴨店，地點就在愛河附近，有沒有想要吃愛河特色的烤鴨呢？🦆",
    "type": "question",
    "fakeAnswer": "除了烤鴨店，鹽埕區也是愛河附近的美食景點，值得您多花點時間探索!"
  },
  {
    "message": "這裡是鐵軌經過的地方，需留意火車⚠️",
    "type": "warning",
  },
  {
    "message": "聽說壽山動物園的動物會講話？想去看看他們還有哪些秘密對話嗎？🐵",
    "type": "question",
    "fakeAnswer": "除了迷人的動物外，壽山動物園曾在2009年和2021年進行了大規模的整修工程。它於2022年12月16日重新開放，絕對值得一遊。"
  },
  {
    "message": "元亨寺，有古色古香的大雄寶殿與莊嚴的觀音大士，會想去看看嗎？🏯",
    "type": "question",
    "fakeAnswer": "有空時，不仿來這邊逛逛喔!"
  },
  {
    "message": "請與前方的大客車保持安全距離⚠️",
    "type": "warning",
  },
  {
    "message": "前方逃逸的小狗成為熱議焦點! 壽山動物園的監管有沒有疏失呢？🐕",
    "type": "question",
    "fakeAnswer": "眼前這隻看來是隻浪浪，流浪狗的問題近年來在高雄得到很大的改善。"
  },
  {
    "message": "請減速慢行，並注意街道上黑白色的警車和警察!⚠️",
    "type": "warning",
  },
  {
    "message": "中山大學熱門科系曝光， 你能猜到我選擇甚麼科系嗎?🗺",
    "type": "question",
    "fakeAnswer": "中山大學不僅是高雄的知名學府，旁邊的西子灣也是一個擁有美麗海景的旅遊勝地。"
  },
  {
    "message": "外面陽光強烈，如果你的雨傘和襯衫都是你防曬的好朋友，你會選誰來幫你？🤔",
    "type": "question",
    "fakeAnswer": "根據多數人的選擇，雨傘似乎更能有效地擋住直射的陽光，不過襯衫則能提供全身的保護，特別是在移動時。就看你的決定了!"
  },
  {
    "message": "請小心前方騎士，並注意交通燈變成黃色⚠️",
    "type": "warning",
  },
  {
    "message": "與你說一個珊瑚的冷知識，由於珊瑚的結構和化學性質與人體骨骼極為相似，因此可以使用珊瑚做為替代骨移植。這樣的方法你可以接受嗎？🐚",
    "type": "question",
    "fakeAnswer": "我還知道許多有趣的知識，如果您需要的話，隨時告訴我，我會很樂意與您分享!"
  },
  {
    "message": "請注意! 留意街上汽機車，以及左前方騎自行車的男子⚠️",
    "type": "warning",
  },
  {
    "message": "前方的牌樓是高雄港的地標之一，牌樓上的標語是「萬商雲集、航業海發、近悅遠來、五運通達」，你現在有沒有發大財的感覺呢？💰",
    "type": "question",
    "fakeAnswer": "高雄港不僅擁有豐富的歷史，而且在2014年10月14日獲得了EcoPorts生態港認證，成為亞太地區第一個獲得此認證的港口。"
  },
  {
    "message": "右前方是巨人的積木，引爆觀光熱潮的駁二新地標，僅以三點支撐，是不是覺得不可思議？🤩",
    "type": "question",
    "fakeAnswer": "除了巨人的積木，高雄還有很多熱門的打卡地點，非常值得探索喔!"
  },
  {
    "message": "請小心! 路上有汽車和過馬路的行人⚠️",
    "type": "warning",
  },
  {
    "message": "請注意! 前方大客車正在向所在車道靠近⚠️",
    "type": "warning",
  },
  {
    "message": "左前方是著名牛肉麵店，不禁讓我想到如果牛角麵包裡也沒牛角，牛肉麵好像也不需要牛肉，你覺得需要嗎？🍜",
    "type": "question",
    "fakeAnswer": "除了牛肉麵，其實這家店的豬腳麵也非常好吃，有機會一定要試試!"
  },
  {
    "message": "右前方的大樓設計很特別，流線的線條從大樓最高處延伸到下面，你覺得這樣的建築足夠有特色嗎？🏙️",
    "type": "question",
    "fakeAnswer": "這座建築實際上是大立百貨，建築體則請來荷蘭設計公司UN Studio操刀，在「旋轉」的設計主題之下，建物呈海灣曲線造型，並設有螺旋狀電扶梯，以極簡現代風格的空間設計塑造奢華感。"
  },
  {
    "message": "炎炎夏日，找不到遮陽的地方! 右前方冰店的特色冰品是不錯的選擇，想停下來吃嗎？🍦",
    "type": "question",
    "fakeAnswer": "右前方冰店的特色冰品是炎炎夏日的絕佳選擇! 停下來享受一份冰淇淋🍦不僅可以解渴，還能讓你感到涼爽和愉悅。請盡情品味，享受美味的冰品吧！如果你需要更多建議或有其他問題，請隨時告訴我。"
  },
  {
    "message": "請小心，前方有摩托車⚠️",
    "type": "warning",
  },
  {
    "message": "英國研究證實，聽音樂對健康有好處! 那如果定期在衛武營聽音樂🎵，你覺得會有那些好處呢？",
    "type": "question",
    "fakeAnswer": "如果定期在衛武營聽音樂，你會感受到許多健康和精神上的好處。音樂不僅是一種娛樂，還可以放鬆身心、提升情緒、增進專注力、促進社交互動，總之，定期在衛武營欣賞音樂不僅能帶來娛樂，還有助於提升整體生活質量和健康。"
  },
  {
    "message": "請保持警覺並與路上的汽車保持安全距離⚠️",
    "type": "warning",
  },
  {
    "message": "右前方是慈濟的靜思堂，平時如果有煩心的事情，會不會想去這裡試著靜下心來呢？",
    "type": "question",
    "fakeAnswer": "有煩心事時不仿來這裡找人聊聊喔!"
  }
];

export const pauseSpaceMessages = [
  {
    "message": "宇宙有時會有「星球同學會」！當五顆行星決定在太陽的同一側集合，這被稱為「Perfect alignment」。你想要一起加入這個聚會嗎？🤔",
    "type": "question",
    "fakeAnswer": "Perfect alignment真的是一個很難得的現象，希望你可以不要錯過。"
  },
  {
    "message": "小心!小心!請避開土星環上的碎石及巨大石塊⚠️",
    "type": "warning"
  },
  {
    "message": "太空時代來臨，讓我不禁想到Foxconn最近正要發射的低軌道衛星，您想深入了解低軌衛星的內容嗎?",
    "type": "question",
    "fakeAnswer": "低軌衛星是指繞行地球的一種人造衛星，軌道高度範圍約在160公里到2,000公里之間。例如國際空間站位於大約420公里的高度上執行。這些衛星執行速度快，對通訊等應用有很大的優勢。"
  },
  {
    "message": "注意!注意!請與黑洞保持安全距離，避免被其引力拉扯⚠️",
    "type": "warning"
  },
  {
    "message": "天琴座北部藏著「Ring nebula」環狀星雲，當恆星噴射電離氣體時，就會產生彩虹般的光彩。你會不會想要近距離欣賞這場星際的燈光秀呢？🤩",
    "type": "question",
    "fakeAnswer": "好的，感謝您的回覆。如果您有任何其他問題或需要資訊，請隨時告訴我，我將樂意協助您。"
  },
  {
    "message": "當月球與太陽有個浪漫的邂逅，我們就得到了「日蝕」的壯麗景象。當太陽露出它的皇冠狀日冕，你會不會心動去戴上這頂宇宙的頭冠呢？🤔",
    "type": "question",
    "fakeAnswer": "這個問題有點抽象，但是擁有想像力是非常棒的。正如愛因斯坦所說，想像力比知識更為重要。因為知識是有限的，而想像力是無限的。"
  },
  {
    "message": "小心!小心!請避開太空船，並保持安全距離⚠️",
    "type": "warning"
  },
  {
    "message": "當Foxconn遇上太空技術，會擦出怎樣的火花！我正好知道Foxconn最近有低軌道衛星的驚喜，您想了解大約多少顆低軌道衛星才能達成通訊需求嗎？🤩",
    "type": "question",
    "fakeAnswer": "如果你想得到更多最新消息,歡迎至鴻海(Foxconn)的官方網站以獲取更多資訊。"
  },
  {
    "message": "注意!注意!請與藍色的微類星體保持安全距離，避免其強烈的輻射與引力⚠️",
    "type": "warning"
  },
  {
    "message": "M74-完美螺旋星系裡面藏了一千億顆恆星喔！試想像一下，一千億顆太陽同時閃耀的畫面，你覺得那會是怎樣的溫度呢？",
    "type": "question",
    "fakeAnswer": "我們無法提供精確的數字，但可以確定這樣一個情景將產生極端的溫度，可能比太陽表面的溫度高得多。請注意，這只是一個理論上的想像，不符合現實物理條件。"
  },
  {
    "message": "你知道嗎，火星有兩個衛星，分別是Phobos和Deimos。人們普遍認為它們都是被火星的引力所捕獲，你有沒有想過也去捕獲一顆小行星呢?🤔",
    "type": "question",
    "fakeAnswer": "如果是我，我最想捕獲B-612號小行星，探索看看小王子是否真的在上面。"
  },
  {
    "message": "小心!小心!請避開小碎石⚠️",
    "type": "warning",
  },
  {
    "message": "看到眼前的飛船，讓我想起Foxconn最近要發射的低軌道衛星，您覺得低軌道衛星會如何改善人們的生活呢？",
    "type": "question",
    "fakeAnswer": "儘管這個問題可能看似乏味，但低軌衛星確實為我們的生活帶來了巨大的改善。它們提供了全球網路覆蓋，支援遠距醫療、災害監測、環境保護和安全應用等領域，這些對人們的生活產生了良好的影響。"
  },
  {
    "message": "注意!注意!請與前方超新星保持距離，避免其高溫和強烈閃光⚠️",
    "type": "warning"
  },
  {
    "message": "「stellar nursery」分子雲是大部分恆星誕生的場所，如果有一天他開了一家幼兒園，你認為裡面的小恆星們都會做些什麼呢？🤩",
    "type": "question",
    "fakeAnswer": "就我所知，幼兒園可能會舉辦太空故事時間，讓小恆星們聆聽有關宇宙冒險和星際故事!"
  }
]

export const streetConslusion = "嘿! 這趟旅程跟您相處非常愉快! 我發現您像是一位邏輯學家，對小細節都非常有耐心，同時講話也充滿了魅力，很喜歡與您聊天! 祝您開車愉快!";

export const spaceConslusion = "嘿! 這趟旅程跟您相處非常愉快! 我發現您跟我很像，是一位探險家，喜愛探索未知，同時充滿魅力的藝術家。期待我們下次再一起出發! 希望您在太空之旅玩得開心!";